In [1]:
import numpy as np
import pandas as pd

In [2]:
data=np.random.randn(4,3)

In [3]:
data

array([[-0.41542245, -0.8257743 ,  0.05372474],
       [ 0.39912927,  0.3774129 , -0.71380473],
       [ 1.79111706,  1.12563438,  1.41992159],
       [ 0.92127431,  0.50936691, -0.81039581]])

In [4]:
pd.DataFrame(data)

          0         1         2
0 -0.415422 -0.825774  0.053725
1  0.399129  0.377413 -0.713805
2  1.791117  1.125634  1.419922
3  0.921274  0.509367 -0.810396

In [5]:
yeniData=pd.DataFrame(data,index=["atil","esra","zeynep","mehmet"],columns=["maas","yas","cs"])

In [6]:
yeniData

            maas       yas        cs
atil   -0.415422 -0.825774  0.053725
esra    0.399129  0.377413 -0.713805
zeynep  1.791117  1.125634  1.419922
mehmet  0.921274  0.509367 -0.810396

In [7]:
yeniData.loc["atil"]

maas   -0.415422
yas    -0.825774
cs      0.053725
Name: atil, dtype: float64

In [8]:
yeniData.iloc[0]

maas   -0.415422
yas    -0.825774
cs      0.053725
Name: atil, dtype: float64

In [9]:
yeniData["emeklilik yasi"]=yeniData["yas"]+yeniData["yas"]

In [10]:
yeniData

            maas       yas        cs  emeklilik yasi
atil   -0.415422 -0.825774  0.053725       -1.651549
esra    0.399129  0.377413 -0.713805        0.754826
zeynep  1.791117  1.125634  1.419922        2.251269
mehmet  0.921274  0.509367 -0.810396        1.018734

In [11]:
yeniData.drop("emeklilik yasi",axis=1)

            maas       yas        cs
atil   -0.415422 -0.825774  0.053725
esra    0.399129  0.377413 -0.713805
zeynep  1.791117  1.125634  1.419922
mehmet  0.921274  0.509367 -0.810396

In [12]:
# axcis x veya y anlamına gelir eksen demektir.

In [13]:
yeniData.drop("mehmet")

            maas       yas        cs  emeklilik yasi
atil   -0.415422 -0.825774  0.053725       -1.651549
esra    0.399129  0.377413 -0.713805        0.754826
zeynep  1.791117  1.125634  1.419922        2.251269

In [14]:
# eksenel olarak dropta öncelik x eksenindedir

In [15]:
# 6.28 ' de kaldım.

In [16]:
yeniData.loc["atil"]["maas"]

-0.41542245154502405

In [17]:
yeniData

            maas       yas        cs  emeklilik yasi
atil   -0.415422 -0.825774  0.053725       -1.651549
esra    0.399129  0.377413 -0.713805        0.754826
zeynep  1.791117  1.125634  1.419922        2.251269
mehmet  0.921274  0.509367 -0.810396        1.018734

In [18]:
yeniData<0

         maas    yas     cs  emeklilik yasi
atil     True   True  False            True
esra    False  False   True           False
zeynep  False  False  False           False
mehmet  False  False   True           False

In [19]:
yeniData[yeniData["maas"]<0]

          maas       yas        cs  emeklilik yasi
atil -0.415422 -0.825774  0.053725       -1.651549

## İNDEX DEĞİŞTİRME

In [20]:
# YANİ Y EKSENİN DE YAZILI OLANLARA İNDEX DİYORUZ VE İSİMLERİNİ DEĞİŞTİRECEĞİZ

In [21]:
yeniData

            maas       yas        cs  emeklilik yasi
atil   -0.415422 -0.825774  0.053725       -1.651549
esra    0.399129  0.377413 -0.713805        0.754826
zeynep  1.791117  1.125634  1.419922        2.251269
mehmet  0.921274  0.509367 -0.810396        1.018734

In [22]:
yeniData.reset_index()

    index      maas       yas        cs  emeklilik yasi
0    atil -0.415422 -0.825774  0.053725       -1.651549
1    esra  0.399129  0.377413 -0.713805        0.754826
2  zeynep  1.791117  1.125634  1.419922        2.251269
3  mehmet  0.921274  0.509367 -0.810396        1.018734

In [23]:
 yeniDatayeniListem=["zey","ati","naz","fey"]

In [24]:
yeniData["üc harfli isim"]=yeniDatayeniListem

In [29]:
yeniData

            maas       yas        cs  emeklilik yasi üc harfli isim
atil   -0.415422 -0.825774  0.053725       -1.651549            zey
esra    0.399129  0.377413 -0.713805        0.754826            ati
zeynep  1.791117  1.125634  1.419922        2.251269            naz
mehmet  0.921274  0.509367 -0.810396        1.018734            fey

In [30]:
yeniData.drop("üc harfli isim",axis=1)

            maas       yas        cs  emeklilik yasi
atil   -0.415422 -0.825774  0.053725       -1.651549
esra    0.399129  0.377413 -0.713805        0.754826
zeynep  1.791117  1.125634  1.419922        2.251269
mehmet  0.921274  0.509367 -0.810396        1.018734

In [32]:
yeniDataFrame=pd.DataFrame(yeniData)

In [33]:
yeniDataFrame

            maas       yas        cs  emeklilik yasi üc harfli isim
atil   -0.415422 -0.825774  0.053725       -1.651549            zey
esra    0.399129  0.377413 -0.713805        0.754826            ati
zeynep  1.791117  1.125634  1.419922        2.251269            naz
mehmet  0.921274  0.509367 -0.810396        1.018734            fey

In [41]:
IlkIndeksler=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [42]:
IcIndeksler=["Homer","Bart","Marge","Cartmen","Kenny","Kyle"]

In [43]:
birlesmisIndeks=list(zip(IlkIndeksler,IcIndeksler))

In [44]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartmen'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [46]:
MultiIndeks=pd.MultiIndex.from_tuples(birlesmisIndeks)

In [47]:
MultiIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartmen'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [48]:
benimCizgiFilmListem=[[40,"A"],[30,"B"],[20,"C"],[40,"D"],[50,"E"],[60,"F"]]

In [49]:
benimCizgiFilmListem

[[40, 'A'], [30, 'B'], [20, 'C'], [40, 'D'], [50, 'E'], [60, 'F']]

In [50]:
CizgiFilmNupyDizisi=np.array(benimCizgiFilmListem)

In [51]:
CizgiFilmNupyDizisi

array([['40', 'A'],
       ['30', 'B'],
       ['20', 'C'],
       ['40', 'D'],
       ['50', 'E'],
       ['60', 'F']], dtype='<U11')

In [52]:
CizgiFilmDataFrame=pd.DataFrame(CizgiFilmNupyDizisi,index=MultiIndeks,columns=["YAS","MESLEK"])

In [53]:
CizgiFilmDataFrame

                   YAS MESLEK
Simpson    Homer    40      A
           Bart     30      B
           Marge    20      C
South Park Cartmen  40      D
           Kenny    50      E
           Kyle     60      F

In [54]:
CizgiFilmDataFrame.loc["Simpson"]

      YAS MESLEK
Homer  40      A
Bart   30      B
Marge  20      C

In [55]:
CizgiFilmDataFrame.loc["Simpson"].loc["Homer"]

YAS       40
MESLEK     A
Name: Homer, dtype: object

In [56]:
CizgiFilmDataFrame.index.names="Film Adı","Isim"

In [57]:
CizgiFilmDataFrame

                   YAS MESLEK
Film Adı   Isim
Simpson    Homer    40      A
           Bart     30      B
           Marge    20      C
South Park Cartmen  40      D
           Kenny    50      E
           Kyle     60      F